import React from 'react';

function Errands() {
  /* eslint max-len:off */
  return (
    <div className="textContent">
      <h2>使用协议</h2>
      <p>
        在使用搭把手跑腿服务前，请您务必先仔细阅读并同意本协议以下条款：<br />
        1、《搭把手跑腿》所提供的各项服务的所有权和运营权，均归【宁波搭把手电子商务有限公司】所有。<br />
        2、服务条款（以下简称“本协议”）系用户因使用《搭把手跑腿》的各项服务而与《搭把手跑腿》所签订的正式、完整的协议。用户在《搭把手到家》注册，即表示接受本协议的所有条件及条款。<br />
        3、本条款内容同时包括《搭把手跑腿》不定时更新及发布的相关协议、业务规则等内容。上述内容一经正式发布，即为本条款不可分割的组成部分。<br />
        4、本条款所提《搭把手跑腿》，是指【宁波搭把手电子商务有限公司】。
      </p>
      <h2>第1条 定义</h2>
      <p>
        1.1 搭把手跑腿并不直接参与商户与跑客间的配送交易，双方因配送合同履行发生争议的，应当根据合同相对性原则自行协商处理或寻求搭把手跑腿调解争议。<br />
        1.2 商户，是指在搭把手跑腿商家平台发布的，显示在搭把手跑腿的配送订单的需求方。<br />
        1.3 跑客，是指搭把手跑腿的配送服务的提供方。本条款项下，特指已经登录搭把手跑腿
        ，并自愿申请注册，且具有完成配送订单之条件和资质的用户，不分性别。跑客依约完成配送订单的，有权根据搭把手跑腿自商户处获取相应的报酬。任何时候跑客与搭把手跑腿间并非劳动、劳务、雇佣关系。<br />
        1.4
        配送订单，是指商户通过搭把手跑腿商家平台发布的，在搭把手跑腿显示的配送服务要约信息（包括但不限于商户信息、配送货物、配送地址、收货人信息及配送费用等），跑客一旦通过点击或确认的方式承诺配送订单的，配送合同即为生效。订单作为跑客与商户的配送合同，是双方权利义务的证明文件；双方线下达成交易条件（例如代收货款、附条件配送等）的，各自自行保留相应的证据。
      </p>
      <h2>第2条 服务条款的确认和接受</h2>
      <p>
        2.1
        跑客应在使用搭把手跑腿服务前，务必先仔细阅读本协议及相关业务规则。如对条款有任何疑问，请及时咨询搭把手跑腿客服热线0574-22222123。但无论跑客事实上是否在使用搭把手跑腿服务前仔细阅读本协议及相关业务规则，只要成功注册或使用搭把手跑腿的服务的，即视为跑客同意本协议并对商户产生约束，届时跑客不应以未阅读本协议或未获得搭把手跑腿客服对问询的解答等理由，主张本协议无效或要求撤销本协议。<br />
        2.2
        跑客必须完全同意所有服务条款并完成注册程序，才能成为搭把手跑腿的注册用户。在跑客按照注册页面提示填写信息、阅读并同意本条款并完成全部注册程序后，或以搭把手跑腿允许的其他方式实际使用搭把手跑腿的服务时，跑客即受本条款的约束。<br />
        2.3
        跑客确认有条件、有资质注册和使用搭把手跑腿的服务。跑客应当是具备完全民事行为能力和责任能力的自然人、法人或法律确定的其他组织，跑客注册和使用搭把手跑腿商户平台的服务不违反任何法律或合同约定的义务（包括但不限于竞业限制义务、保密义务等）。如果不具备前述条件或资格的，搭把手跑腿有权中止或注销该跑客的账户；由此给搭把手跑腿造成损失的，搭把手跑腿赔偿平台有权向跑客追偿（包括但不限于赔偿金、补偿金、罚金以及诉讼费、调查费及律师费等）。<br />
        2.4
        跑客应当保证注册时提供的信息的完整性、真实性、合法性。搭把手跑腿有权根据业务需要，不时审核跑客的注册信息是否完整真实有效，一旦发现跑客信息不符合搭把手跑腿业务规则的，搭把手跑腿有权中止或注销该跑客。<br />
        2.5 跑客承诺一经确认订单，即应如约完整履行。搭把手跑腿有权根据业务规则采取扣款、罚款、中止抢单资格、注销账户等方式处罚跑客的履约瑕疵行为。<br />
        2.6 根据业务需要，搭把手跑腿保留在国家法律允许的范围内，独自决定拒绝服务、中止服务、终止服务或注销跑客账户的权利。<br />
        2.7
        根据业务需要，搭把手跑腿保留在国家法律允许的范围内，不时地制订、修改本条款或业务规则，并以微信公众号的方式进行公示。如跑客继续使用搭把手跑腿的服务的，即表示跑客接受经修订的协议和规则。
      </p>
      <h2>第3条 平台服务内容</h2>
      <p>
        3.1
        搭把手跑腿提供的服务包括搭建、提供及维护信息发布；为注册跑客提供账户信息管理、配送信息发布与查询、配送交易与处理、订单查询与管理、定价建议与咨询、代理配送费磋商与谈判、配送费用代收代垫与代付等互联网信息服务和在线交易处理服务。具体以搭把手跑腿届时有效的服务内容为准。<br />
        3.2搭把手跑腿会尽力保证服务的有效性与可用性，若因网络故障、黑客攻击或政策变动等不可控因素，可能导致上述部分或全部服务调整或失效，跑客理解并接受该等情形的出现，并放弃因此向搭把手跑腿索赔的权利。<br />
        3.3 跑客须自行准备如下服务设备，并承担相关服务开支：<br />
        （1）服务设备，包括并不限于手机、电脑或者其他移动终端、调制解调器及其他必备的上网装置。<br />
        （2）服务开支，包括并不限于网络接入费、上网设备租用费、网络流量费、结算手续费，以及履行配送服务过程可能发生的其他费用等。<br />
        3.4
        跑客同意授权搭把手跑腿自商户处代为收取配送费用。配送费用的结算方式及结算周期根据搭把手跑腿届时有效的规则执行。因跑客提供无效的、错误的、不完整的结算账户信息导致的结算延迟、错误等责任由跑客自行承担。跑客同意并理解，配送费结算过程中可能产生的手续费或税费由跑客自行承担，搭把手跑腿有权提前扣除。<br />
        3.5为了最大限度的维护跑客利益，跑客委托搭把手跑腿根据届时有效的业务规则购买相应的商业保险，相关费用从代收的配送费用中扣除，跑客可以在跑客账户查询保险条款、保险购买记录及保单号等信息。<br />
        3.6
        跑客使用搭把手跑腿服务而需要下载相关客户端程序时，搭把手跑腿给予跑客一项单个的、不可转让及非排他性的许可。跑客在使用搭把手跑腿服务时使用相关客户端程序，不得进行反向工程、汇编及编译，或者以其他方式尝试读取相关客户端程序的源代码；不得删除相关客户端程序及其副本上关于著作权的信息。跑客终止使用搭把手跑腿服务时，应当立即删除相关客户端程序及其数据。<br />
        3.7宁波搭把手电子商务有限公司保留本条及本协议其他条款未明示授权的其他一切权利，跑客在行使这些权利时须取得搭把手跑腿的书面许可。搭把手跑腿如果未行使上述任何权利，并不构成对该权利的放弃。
      </p>
      <h2>第4条 账户管理</h2>
      <p>
        4.1 跑客账户的所有权归搭把手跑腿所有，跑客在完成申请注册手续后，仅获得跑客帐号的使用权，且该使用权仅属于初始申请注册人。<br />
        4.2
        跑客注册成功后，将生成由跑客自行设置的用户名和密码等账户信息，跑客可以根据搭把手跑腿业务规则更改密码。跑客应谨慎合理的保存、使用其商户名和密码，并对利用跑客的商户名和密码完成管理权限验证而实施的所有行为、活动及事件负全责。跑客若发现任何不当使用跑客账号或存在安全漏洞等其他可能危及账户安全的情况，应当立即以有效方式通知搭把手跑腿，要求搭把手跑腿暂停相关服务，并向公安机关报案。<br />
        4.3
        跑客依据4.2条发出的通知至少应当包括情况描述，相关的初步证据，要求搭把手跑腿处理措施，通知人联系信息等，缺乏上述信息的通知视为无效通知。跑客理解搭把手跑腿对跑客的通知请求识别、采取行动需要合理时间，搭把手跑腿对在采取行动前已经产生的后果（包括但不限于跑客的任何损失）不承担任何责任。<br />
        4.4 跑客不得将账户借/租给他人使用，否则跑客应承担由此产生的全部责任，并与实际使用人承担连带责任。一经发现搭把手跑腿有权注销此等账户。<br />
        4.5
        跑客理解并同意，搭把手跑腿有权使用跑客的注册信息，登陆进入跑客的注册账户，进行证据保全，包括但不限于公证、见证等；同时为了更好的为跑客提供服务，搭把手跑腿及其关联方可以无偿的、商业性的分析和使用跑客注册信息及使用数据。<br />
        4.6为避免造成资源浪费搭把手跑腿有权回收、注销长期不登录的跑客帐号，由此带来的任何损失均由跑客自行承担。<br />
        4.7搭把手跑腿通过向跑客注册时预留的地址、电话、邮箱等任一方式发送信息，或者通过搭把手跑腿发送站内信息，即视为搭把手跑腿向跑客履行了送达、通知义务。
      </p>
      <h2>第5条 责任范围与责任限制</h2>
      <p>
        5.1跑客委托配送服务的合同相对方为商户，合同履行的瑕疵担保及付款责任应当由商户依据约定内容承担，作为交易信息平台的搭把手跑腿，与商户是独立的商事主体，不向商户承担任何担保或连带责任。<br />
        5.2
        跑客在履行配送服务之前，应当自行审核商户的真实性及履约能力，应当要求商家明示配送货物的性质和品类，以及货物接收人的信息，作为交易信息平台的搭把手跑腿，不承担任何担保或连带责任。特别地，搭把手·跑腿作为交易信息平台，无法控制每一配送订单所涉及的物品的质量、安全或合法性，以及配送交易的真实性或准确性。跑客因完成配送服务而遭受人身损害、财产损害的，或造成第三方人身损害、财产损害的，应当依法向责任主体追究法律责任，搭把手·跑腿不承担任何责任。<br />
        5.3
        跑客与商家达成配送订单信息以外的线下交易或条件（例如代收货款、附条件配送等）的，跑客应当自行保留相应的证据，并在各自责任范围内承担相应的法律责任。任何时候，跑客禁止承揽配送下列货物：<br />
        （1）国家法律法规禁止配送的；<br />
        （2）国家法律法规要求特殊资质或条件配送的。<br />
        5.4 有且仅当法律法规明确要求，或出现以下情况，搭把手跑腿才对商户及用注册信息、配送订单信息进行事先或事后的审查：<br />
        （1）应商户或用户要求的，且有合理的理由认为特定商户、用户或交易可能存在重大违法或违约情形。<br />
        （2）应商户或跑客要求的，且有合理的理由认为商户、用户在搭把手跑腿的行为涉嫌违法或不当。<br />
        跑客理解并同意，受限于数据及技术条件，搭把手跑腿的上述审查行为无法做到完全审查。<br />
        5.5
        依据法律或本条款有明确的赔偿义务的前提下，搭把手跑腿的赔偿限额为单笔配送订单的配送费，且不对因下述情况而导致的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿：<br />
        （1）使用或未能使用搭把手跑腿的服务；<br />
        （2）第三方未经批准地使用或更改跑客的数据；<br />
        （3）通过搭把手跑腿的服务购买或获取任何商品、样品、数据、信息等行为或替代行为产生的费用及损失；<br />
        （4）跑客对搭把手跑腿的服务的误解；<br />
        （5）任何非因搭把手跑腿的过错原因而引起的与搭把手跑腿的服务有关的其它损失。<br />
        5.6
        如因不可抗力或其他搭把手跑腿无法控制的原因使搭把手跑腿系统崩溃或无法正常使用，从而导致配送交易无法完成或丢失有关的信息、记录等，搭把手跑腿不承担责任。搭把手跑腿会尽可能合理地协助处理善后事宜，并努力使商户免受或减少经济损失。<br />
        5.7
        跑客在发现搭把手跑腿任何内容不符合法律规定，或不符合本条款规定的，有义务及时通知搭把手跑腿。如果跑客发现合法权利受到侵害，请将此情况告知搭把手跑腿并同时提供如下信息和材料：<br />
        （1）侵犯跑客权利的信息的网址，编号或其他可以找到该信息的细节；<br />
        （2）跑客的联系方式，包括联系人姓名、地址、电话号码和电子邮件；<br />
        （3）跑客的身份证复印件、营业执照等其他相关资料。<br />
        经审查得到证实的，搭把手跑腿将及时删除相关信息。搭把手跑腿仅接受邮寄、电子邮件或传真方式的书面侵权通知。情况紧急的，跑客应通过客服电话先行告知，搭把手跑腿会视情况采取相应措施。<br />
        5.8
        跑客应当严格遵守本条款及搭把手跑腿发布的其他协议、活动规则，因跑客违反协议或规则的行为给第三方或搭把手跑腿造成损失的，跑客应当承担全部责任，搭把手跑腿因此承担责任的，有权向跑客追偿。<br />
        5.9 搭把手·跑腿可能会与第三方合作向跑客提供相关的服务（包括但不限于广告服务、支付服务、寻址定位服务等），在此情况下，搭把手跑腿不保证该第三方提供的服务的可用性、有效性和合法性。
      </p>
      <h2>6.软件使用条款</h2>
      <p>
        您需要下载搭把手到家提供的手机软件并安装后方得以从手机客户端使用搭把手到家所提供的服务。
        搭把手到家在此授予您免费的、不可转让的、非独占的全球性个人许可，允许您使用由搭把手到家提供的、包含在服务中的软件。但是，您不得复制、修改、发布、出售或出租我们的服务或所含软件的任何部分，也不得进行反向工程或试图提取该软件的源代码，除非您已获得搭把手到家的书面许可。搭把手到家服务所包含或提供的所有内容诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件都是搭把手到家或其内容提供者的财产，受中国和国际版权法的保护。搭把手到家上所提供使用的所有软件都是搭把手到家或其软件供应商的财产，受中国和国际版权法的保护。
      </p>
      <h2>第7条 信息与数据所有权</h2>
      <p>
        本网站服务所包含或者提供的图表、标识、网页页眉、
        按钮图标、文字、服务品名均为搭把手到家的商标、注册商标或商业外观。这些商标或商业外观不得以任何可能引起消费者混淆的方式或任何诋毁或诽谤搭把手到家的方式用于与本网站或其关联公司无关联的任何商品或服务上。未经搭把手到家的书面许可，本网站上的任何内容都不应被解释为以默许或其他方式授予许可或使用本网站上出现的商标的权利。
      </p>
      <h2>8.服务的修改和终止</h2>
      <p>
        7.1 搭把手跑腿各项信息服务及其载体，以及交易处理数据的所有权和运营权归搭把手·跑腿所有，搭把手·跑腿可依自身义务需要采取任何商业性利用或开发。<br />
        7.2
        搭把手跑腿服务内容包括：文字、软件、声音、图片、录像、图表、广告中的全部内容，电子邮件的全部内容，搭把手跑腿为商户提供的其他信息。这些内容享有版权、商标、标签和其它财产权法律的保护。所以，商户只能在搭把手跑腿和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。搭把手跑腿所有的文章版权归原文作者和搭把手跑腿共同所有，任何人需要转载该类文章或信息，必须征得原文作者或搭把手跑腿授权。<br />
        7.3
        跑客接受本条款条款，即表明该跑客将其在搭把手跑腿发表的任何形式的信息的著作权或其他合法权利，包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利无偿独家转让给搭把手跑腿所有，同时表明该跑客许可搭把手·跑腿有权就任何主体侵权而单独提起诉讼，并获得全部赔偿。本条款效力及于跑客在搭把手跑腿发布的任何受著作权法保护的作品内容，无论该内容形成于本条款签订前还是本条款签订后。搭把手跑腿均保留删除站内各类不符合规定的信息而不通知跑客的权利。
      </p>
      <h2>跑客行为规范</h2>
      <p>
        8.1 跑客须严格按照搭把手跑腿提供、发布、更新的服务条款和业务规则执行。搭把手跑腿不时发布的成文或非成文的业务规则，以及既成的交易模式或惯例，视为本条款的重要组成部分。<br />
        8.2 在使用搭把手跑腿服务过程中，跑客须遵守以下约定：<br />
        （1）在使用搭把手跑腿的服务过程中实施的所有行为均遵守国家法律、法规等规范文件及搭把手跑腿的各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本条款及相关规则。如果违反上述承诺，产生任何法律后果的，跑客应以自己的名义独立承担所有的法律责任，并确保搭把手跑腿免于因此产生任何损失。<br />
        （2）不发布国家禁止发布的信息（拥有合法许可除外），不发布涉嫌侵犯他人知识产权或其它合法权益的信息，不发布违背社会公共利益或公共道德、公序良俗的信息，不发布其它涉嫌违法或违反本条款及各类规则的信息。<br />
        （3）不对搭把手跑腿上的任何数据或信息作商业性利用，包括但不限于在未经搭把手跑腿事先书面同意的情况下，以复制、传播等任何方式使用，或许可、泄露给任何第三方使用，或者为任何第三方使用提供便利，该等责任及于跑客与搭把手跑腿配送服务平台服务关系终止后三年。<br />
        （4）不使用任何装置、软件或例行程序干预或试图干预搭把手跑腿的正常运作或正在搭把手跑腿上进行的任何活动。跑客不得采取任何将导致不合理的庞大数据负载加诸搭把手跑腿网络设备的行动。<br />
        （5）不得发表、传播、储存侵害他人知识产权、商业秘密权等合法权利的内容或包含病毒、木马、定时炸弹等可能对搭把手跑腿服务系统造成伤害或影响其稳定性的内容。<br />
        （6）不得进行危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器帐号；不得未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；不得未经许可，企图探查、扫描、测试本平台系统或网络的弱点或其它实施破坏网络安全的行为；不得企图干涉、破坏本平台系统。<br />
        （7）不得发布任何有损搭把手跑腿商誉的言论。<br />
        8.3 跑客理解并同意：<br />
        （1）违反上述承诺时，搭把手跑腿有权依据本条款的约定，做出相应处理或终止提供服务，且无须征得跑客的同意或提前通知跑客。<br />
        （2）根据相关法令的指定或者搭把手跑腿服务规则的判断，跑客的行为涉嫌违反法律法规的规定或违反本条款或规则条款的，搭把手跑腿有权采取相应措施，包括但不限于罚款、暂扣款项、直接屏蔽、删除侵权信息、降低信用值或直接停止提供服务，直至注销账户。<br />
        （3）对于跑客在搭把手跑腿上实施的行为，包括未在搭把手跑腿上实施但已经对搭把手跑腿及其跑客产生影响的行为，搭把手跑腿有权单方认定该行为的性质及是否构成对本条款或规则的违反，并据此采取相应的必要的处理措施。<br />
        （4）对于跑客涉嫌违反承诺的行为对任意第三方造成损害的，跑客应以自己的名义独立承担所有的法律责任，并确保搭把手跑腿免于承担因此产生的损失或增加的费用。<br />
        （5）若跑客涉嫌违反有关法律或本协议，使搭把手跑腿遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，跑客应当赔偿搭把手跑腿因此造成的损失及发生的费用，包括合理的律师费用。<br />
        8.4 跑客因使用搭把手·跑腿而获取的收益，应当自行依法缴纳相关税费。
      </p>
      <h2>第9条 法律管辖和适用</h2>
      <p>
        9.1 本条款的订立、执行和解释及争议的解决均适用于中国法律。<br />
        9.2如双方就本条款内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向搭把手跑腿所在地的人民法院提起诉讼。<br />
        9.3本协议条款无论因何原因导致部分无效或不可执行，其余条款仍有效，对双方具有约束力。
      </p>
    </div>
  );
}

export default Errands;