import React from 'react';

function Tidy() {
  /* eslint max-len:off */
  return (
    <div className="textContent">
      <p>
        欢迎访问搭把手到家，
        使用我们提供的服务。“搭把手到家”的服务由余姚搭把手家政服务有限公司（以下简称搭把手）基于以下服务条款及使用条件而提供，请您仔细阅读。您点击"同意并继续"按钮后，即视为您接受并同意遵守本协议的约定。
      </p>
      <h2>第1条 服务条款的确认和接纳</h2>
      <p>
        1.1搭把手到家的各项服务的所有权和运作权归搭把手所有。您同意所有注册协议条款并完成注册程序，才能成为搭把手到家的正式用户。您确认：本协议条款是处理双方权利义务的依据，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定或约定。
      </p>
      <h2>第2条 搭把手到家帐户</h2>
      <p>
        2.1为了使用我们提供的服务，您需要注册一个搭把手到家帐户，帐户名即为您所提供的常用手机号码。通过搭把手到家下发的验证码进行帐户验证后，该帐户即可以使用。您可以在帐户中查询到您的订单记录，包括为您提供服务的家政服务人员信息及所提供服务的具体地点记录。<br />
        2.2如果您使用搭把手到家服务，您应负责维护您的帐户的保密性并限制第三方使用/访问您的计算机或移动设备，并且，您同意对在您的帐户和密码下发生的所有活动承担责任。如果您未满18周岁，您只能在父母或监护人的参与下使用服务。我们保留自行决定终止提供服务、关闭帐户、删除或编辑内容或取消订单的权利。
      </p>
      <h2>第3条 搭把手到家服务</h2>
      <p>
        3.1您应了解并知悉，搭把手到家是为家政服务人员及用户提供家政服务信息发布及访寻的服务平台，家政服务人员由各家政公司向搭把手到家平台推荐。用户与家政服务人员通过搭把手到家的服务平台，在双方之间达成独立的家政服务合同，并承担相应的权利和义务。如因家政服务人员原因导致用户遭受相关财产或人身损害的，用户可直接向家政公司及家政服务人员追偿，搭把手到家及搭把手公司不承担任何法律责任。<br />
        3.2账户分为充值本金账户与赠送账户两部分。当充值本金账户有余额时，优先使用本金账户支付服务费用。<br />
        3.3当您停止使用搭把手到家服务、关闭帐户时，搭把手到家会在全额扣除赠送额度后，退回您剩余的本金。<br />
        3.4搭把手到家各项服务价格均采用浮动机制。搭把手到家有权根据市场行情对价格进行临时或永久调整。
      </p>
      <h2>第4条 信息收集及保护</h2>
      <p>
        4.1您同意，“搭把手到家”拥有通过邮件、短信、电话等形式，向您发送活动信息的权利。如您不希望接收上述信息，可退订。<br />
        4.2您同意，“搭把手到家”有权使用您的注册信息、用户名、密码等信息，登陆进入您的注册账户，进行证据保全，包括但不限于公证、见证、协助司法机关进行调查取证等。
      </p>
      <h2>第5条 依法言行义务</h2>
      <p>
        本协议依据国家相关法律法规规章制定，您同意严格遵守以下义务：<br />
        5.1不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；<br />
        5.2不得利用“搭把手到家”从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；<br />
        5.3不得干扰“搭把手到家”的正常运转，不得侵入“搭把手到家”的计算机信息系统；<br />
        5.4不得上传或发布任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料；<br />
        5.5除本协议的约定外，您不得利用在“搭把手到家”注册的账户进行其它未经许可的经营活动或行为；<br />
        5.6您不得在“搭把手到家”发布任何侵犯他人著作权、商标权等知识产权或其他合法权利的内容；如果有其他用户或权利人发现您发布的信息涉嫌知识产权、或其他合法权益争议的，搭把手有权删除。<br />
        5.7若您未遵守以上规定的，搭把手有权做出独立判断并采取暂停或关闭您的账号等措施。
      </p>
      <h2>第6条 服务开始与提供</h2>
      <p>
        6.1 本条款所述“服务订单”，是指搭把手∙家政接受您的委托，按照您提出的具体需求访寻符合要求的家政服务人员的委托服务协议。<br />
        6.2 您与搭把手到家的服务订单在下述时刻正式成立：<br />
        6.2.1您通过搭把手到家联系到能够提供服务的家政服务人员并商定所需家政服务的时间、地点等信息之时；<br />
        6.2.2您通过搭把手到家客服要求搭把手到家在具体时间和地点指派符合其要求的家政服务人员提供服务之时。<br />
        6.2.3搭把手到家将根据服务订单信息访寻到符合要求的家政服务人员，并促成家政服务人员与您达成服务合同。此时，搭把手到家本次向您提供的中介服务完成，与您之间的委托服务协议终止。<br />
        6.2.4如服务订单无法履行（例如无法访寻到适合您要求的家政服务人员的），我们将尽快与您联系并在获得您的许可后取消服务订单。<br />
        6.2.5家政服务人员履行完服务合同后，您可在搭把手到家上对其作出相应的评价，以供搭把手到家进一步改进服务。
      </p>
      <h2>第7条 信息发布</h2>
      <p>
        7.1
        搭把手到家会将家政服务人员信息（包括但不限于姓名、年龄、籍贯和服务报价等）公布于搭把手到家服务平台。该等信息由各家政公司提供，我们努力使该家政服务人员信息尽可能地真实和准确。但是，我们无法就其内容的准确性、完整性、可靠性作出保证。如果您认为上述信
        息与家政服务人员的真实信息不一致，您可以通过服务评价体系通知我们，我们将即刻更新所发布的信息，并对家政服务人员作出相应处理。<br />
        7.2您在搭把手到家发布的信息，除非另行说明，您同意授予搭把手到家非独有的、免费的、永久的、不可撤销的和完全的再许可权的下述许可：在全世界范围内任何媒体上使用、转载、修改、改编、出版、翻译、创作衍生作品、分发和展示这些内容。
      </p>
      <h2>第8条 隐私</h2>
      <p>
        9.1
        搭把手到家服务所包含或提供的文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑等，都是搭把手到家或其内容提供者的财产，受著作权法或商标法等知识产权法的保护。搭把手到家上所提供的所有软件，都是搭把手到家或其软件供应商的财产，受软件著作权法的保护
      </p>
      <h2>第10条 服务的修改和终止</h2>
      <p>
        10.1
        搭把手到家始终在不断更改和改进其所提供的服务。搭把手到家可能会增加或删除某项服务功能，或对搭把手到家的服务增加或设置新的限制，也可能暂停或彻底停止某项服务。如果出现上述事宜，则在可能的情况下，搭把手到家会向您发出合理的提前通知，并让您有机会备份和转移其留存在搭把手到家中的信息。
      </p>
      <h2>第11条 违约责任</h2>
      {/* eslint react/no-unescaped-entities: off */}
      <p>
        11.1 如您违反本协议任意条款的，搭把手到家有权随时终止向您提供服务。<br />
        11.2
        搭把手到家仅就本协议所述服务内容向您承担责任。如果搭把手到家被争议解决机构判定违约，搭把手到家所承担的赔偿责任应以具体赔偿事项所涉的您与家政服务人员达成的家政服务合同之服务价款的三倍为限。
      </p>
      <h2>第12条 责任限制</h2>
      <p>
        12.1搭把手到家负责按"现状"和"可得到"的状态向您提供服务。但搭把手到家服务不作任何明示或暗示的保证。同时，搭把手到家也不对其服务所涉及的技术及信息的有效性、准确性、正确性、可靠性、稳定、完整和及时性作出任何承诺和保证。<br />
        12.2
        搭把手到家对由于政府行为譬如政策或法规的变更、自然灾害或战争、通讯线路中断、黑客攻击、计算机病毒侵入或发作、电信部门技术调整、因政府管制而造成网站或手机APP平台的暂时性关闭等不可抗力事件，以及他人蓄意破坏、正常的系统维护、系统升级，或者因网络拥塞而导致本网站不能访问而造成的本网
        站所提供的信息及数据的延误、停滞或错误，以及使用者由此受到的一切损失不承担任何责任。<br />
        12.3
        搭把手到家不对您所发布信息的保存、修改、删除或储存失败负责。对非因搭把手到家故意所导致的排字错误、疏忽等不承担责任。搭把手到家有权但无义务，改善或更正本网微信平台任何部分之疏漏、错误。
      </p>
      <h2>第13条 协议修改及可分性</h2>
      <p>
        13.1
        为更好地提供服务并符合相关监管政策，我们可以随时修改本协议上述条款。请您定期查阅。我们会在平台上发布修改通知，并列明最近的修改日期。如您不同意我们对相应条款作出的修改，您应立即停止使用搭把手到家所提供的服务。<br />
        13.2 如果本协议中任何一条款被废止、无效或因任何理由不可执行，不影响其余条款的有效性和可执行性。
      </p>
      <h2>第14条 适用法律及管辖</h2>
      <p>
        14.1 您同意本协议以及您和搭把手到家、搭把手之间发生的任何争议均适用中华人民共和国法律。<br />
        14.2 如您与我们发生争议，应友好协商解决，协商不成，任何一方均可提请余姚仲裁委员会,
        按照在线仲裁规则进行仲裁。仲裁裁决是终局的，对双方均有约束力。您同意广州仲裁委员会根据您在搭把手到家注册时填写的电子邮箱、手机号码，向您发送相关通知及法律文件。相关通知及法律文件发出后，视为您已收到。<br />
        14.3 本协议合法有效，是各方真实意思表示，如一方违约，另一方可将之提交余姚仲裁委员会，作为有效的电子数据证据使用，各方均认可其证明力。
      </p>
      <h2>第15条 其它</h2>
      <p>
        15.1搭把手到家、搭把手将通过微信平台发布通知或根据您注册时填写电子邮箱、手机号码信息，以电子邮件或手机短信的方式与您进行联系。您同意我们用这些方式提供给您的所有协议、通知、信息是符合相关的法律法规要求的。如果我们以该等形式向您发出通知或信息，将视为您已收到。<br />
        15.2搭把手到家及搭把手在法律允许最大范围内对本协议拥有解释权与修改权。
        您点击本协议左方的“同意并继续”按钮即视为您完全接受本协议并签订本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。
      </p>
    </div>
  );
}

export default Tidy;